Revit 2027 API
FamilyInstance.HasSpatialElementFromToCalculationPoints Property
Identifies if this instance has a pair of SpatialElementCalculationPoints used as the search points for Revit to identify if the instance lies between up to two rooms or spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSpatialElementFromToCalculationPoints { get; }
Public ReadOnly Property HasSpatialElementFromToCalculationPoints As Boolean
	Get
public:
property bool HasSpatialElementFromToCalculationPoints {
	bool get ();
}
member HasSpatialElementFromToCalculationPoints : bool with get
Return Value
Boolean
True if this instance has a pair of SpatialElementCalculationPoints used as the search points, false otherwise.
Remarks
The points determine which room or space is considered the "from" and which is considered the "to" for a family instance which connects two rooms or spaces, such as a door or window.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace